Revit 2027 API
RebarBendingDetailType.DetailLevel Property
 Identifies the level of detail in which the Bending Detail will be represented.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public BendingDetailLevelOfDetail DetailLevel { get; set; }
Public Property DetailLevel As BendingDetailLevelOfDetail
	Get
	Set
public:
property BendingDetailLevelOfDetail DetailLevel {
	BendingDetailLevelOfDetail get ();
	void set (BendingDetailLevelOfDetail value);
}
member DetailLevel : BendingDetailLevelOfDetail with get, set
Property Value
BendingDetailLevelOfDetail
Exceptions
Exception | Condition
ArgumentOutOfRangeException |  When setting this property: A value passed for an enumeration argument is not a member of that enumeration
See Also
Reference
RebarBendingDetailType Class
Autodesk.Revit.DB.Structure Namespace